; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	thermograph1 - mode
	infrared0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star4 - direction
	GroundStation8 - direction
	Star6 - direction
	GroundStation3 - direction
	Star9 - direction
	GroundStation5 - direction
	Star7 - direction
	Star10 - direction
	GroundStation2 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star6)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
	(supports instrument3 thermograph1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star10)
	(calibration_target instrument3 Star7)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star10)
)
(:goal (and
	(pointing satellite2 GroundStation0)
	(have_image Phenomenon11 infrared0)
	(have_image Star12 thermograph1)
	(have_image Planet13 infrared0)
	(have_image Star14 thermograph1)
	(have_image Planet15 thermograph1)
	(have_image Star16 thermograph1)
))

)

; plan
1. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 7
2. (calibrate satellite2 instrument3 star10)
   added: (calibrated instrument3)
   goals met: 0 of 7
3. (turn_to satellite2 star12 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star12)
   goals met: 0 of 7
4. (take_image satellite2 star12 instrument3 thermograph1)
   added: (have_image star12 thermograph1)
   goals met: 1 of 7
5. (turn_to satellite2 planet15 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 planet15)
   goals met: 1 of 7
6. (take_image satellite2 planet15 instrument3 thermograph1)
   added: (have_image planet15 thermograph1)
   goals met: 2 of 7
7. (turn_to satellite2 planet13 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 planet13)
   goals met: 2 of 7
8. (take_image satellite2 planet13 instrument3 infrared0)
   added: (have_image planet13 infrared0)
   goals met: 3 of 7
9. (turn_to satellite2 phenomenon11 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 phenomenon11)
   goals met: 3 of 7
10. (take_image satellite2 phenomenon11 instrument3 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 4 of 7
11. (turn_to satellite2 star14 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 star14)
   goals met: 4 of 7
12. (take_image satellite2 star14 instrument3 thermograph1)
   added: (have_image star14 thermograph1)
   goals met: 5 of 7
13. (turn_to satellite2 star16 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star16)
   goals met: 5 of 7
14. (take_image satellite2 star16 instrument3 thermograph1)
   added: (have_image star16 thermograph1)
   goals met: 6 of 7
15. (turn_to satellite2 groundstation0 star16)
   deleted: (pointing satellite2 star16)
   added: (pointing satellite2 groundstation0)
   goals met: 7 of 7
